### Task:

- Generated a Synthetic Dataset with columns of `age`, `salary`, `department`, `years_experience`, and `is_manager`.

In [ ]:
np.random.seed(42) # For reproducibility
n_samples = 100 # Number of samples

data = {
    'age': np.random.randint(18, 60, size=n_samples),
    'salary': np.random.randint(30000, 130000, size=n_samples),
    'department': np.random.choice(['IT', 'HR', 'Finance', 'Marketing'], size=n_samples),
    'years_experience': np.round(np.random.normal(5, 2, size=n_samples), 1),
    'is_manager': np.random.choice([0, 1], size=n_samples)
}
df = pd.DataFrame(data)
print(df)

    age  salary department  years_experience  is_manager
0    56   38392         IT              -0.8           0
1    46   60535  Marketing               3.4           1
2    32  108603         HR               5.0           1
3    25   82256         HR               4.2           1
4    38  119135         HR               4.1           1
..  ...     ...        ...               ...         ...
95   59   82662         IT               4.0           0
96   56   42688         HR               4.4           1
97   58   55342  Marketing               6.0           0
98   45   67157         HR              11.4           0
99   24   97863         HR               5.2           1

[100 rows x 5 columns]

Q1. View data structure

In [43]:
df.head()

   age  salary department  years_experience  is_manager
0   56   38392         IT              -0.8           0
1   46   60535  Marketing               3.4           1
2   32  108603         HR               5.0           1
3   25   82256         HR               4.2           1
4   38  119135         HR               4.1           1

Q2. Get DataFrame Info and Summary Stats

In [44]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   age               100 non-null    int32
 1   salary            100 non-null    int32
 2   department        100 non-null    object
 3   years_experience  100 non-null    float64
 4   is_manager        100 non-null    int32
dtypes: float64(1), int32(3), object(1)
memory usage: 2.9+ KB

              age         salary  years_experience  is_manager
count  100.000000     100.000000        100.000000  100.000000
mean    37.910000   77809.160000          4.823000    0.470000
std     12.219454   26058.643576          2.237822    0.501614
min     18.000000   30206.000000         -0.800000    0.000000
25%     26.750000   55141.000000          3.475000    0.000000
50%     38.000000   80932.000000          4.700000    0.000000
75%     46.250000   98107.250000          6.000000    1.000000
max     59.000000  119474.000000         11.400000    1.000000

Q3. Do Simple Numpy Operations

In [45]:
ages = df['age'].values
salaries = df['salary'].values
ages[:5], salaries[:5]

(array([56, 46, 32, 25, 38]), array([ 38392,  60535, 108603,  82256, 119135]))

Q4. Filtering and Indexing Rows

In [46]:
print('Rows with salary > 60000:')
print(df[df['salary'] > 60000].head())
print('\nRow at index 5 using .loc:')
print(df.loc[5])
print('\nRows from index 10 to 12 using .iloc:')
print(df.iloc[10:13])

Rows with salary > 60000:
   age  salary department  years_experience  is_manager
1   46   60535  Marketing               3.4           1
2   32  108603         HR               5.0           1
3   25   82256         HR               4.2           1
4   38  119135         HR               4.1           1
5   56   65222    Finance               2.8           0

Row at index 5 using .loc:
age                      56
salary                65222
department          Finance
years_experience        2.8
is_manager                0
Name: 5, dtype: object

Rows from index 10 to 12 using .iloc:
    age  salary department  years_experience  is_manager
10   41   40965         IT               9.5           1
11   53   54538  Marketing               5.3           0
12   57  100592    Finance               6.1           1

Q5. Adding a Column

In [47]:
df['bonus']=df['salary']*0.15
print(df)

    age  salary department  years_experience  is_manager     bonus
0    56   38392         IT              -0.8           0   5758.80
1    46   60535  Marketing               3.4           1   9080.25
2    32  108603         HR               5.0           1  16290.45
3    25   82256         HR               4.2           1  12338.40
4    38  119135         HR               4.1           1  17870.25
..  ...     ...        ...               ...         ...       ...
95   59   82662         IT               4.0           0  12399.30
96   56   42688         HR               4.4           1   6403.20
97   58   55342  Marketing               6.0           0   8301.30
98   45   67157         HR              11.4           0  10073.55
99   24   97863         HR               5.2           1  14679.45

[100 rows x 6 columns]

Q6. Grouping and Aggregation

In [48]:
df.groupby('department')['salary'].sum()

department
Finance      1994993
HR           1396938
IT           1592335
Marketing    2796650
Name: salary, dtype: int32